Convert list to pandas series ```ds = pd.Series([2,3,4,5])```

Convert pandas series to list ```ds.tolist()```

In [7]:
import pandas as pd

l1 = [2, 4, 6, 8, 10]
l2 = [1, 3, 5, 90, 9]

ds1 = pd.Series(l1)
ds2 = pd.Series(l2)

ds3 = ds1 / ds2
ds3 = ds1 + ds2

Compare values in series

In [8]:
print("Compare the elements of the said Series:")
print("Equals:")
print(ds1 == ds2)
print("Greater than:")
print(ds1 > ds2)
print("Less than:")
print(ds1 < ds2)

Compare the elements of the said Series:
Equals:
0    False
1    False
2    False
3    False
4    False
dtype: bool
Greater than:
0     True
1     True
2     True
3    False
4     True
dtype: bool
Less than:
0    False
1    False
2    False
3     True
4    False
dtype: bool

Convert dictrionary to pandas series ```pd.Series(dict)```

In [9]:
dict1 = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
pd.Series(dict1)

a    100
b    200
c    300
d    400
e    800
dtype: int64

Convert list to numpy array ```np.array(array)```

import numpy as np
x = [10, 20, 30, 40, 50]
np_arr = np.array(x)
pd.Series(np_arr)

In [28]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.to_numeric(s1, errors='coerce')
s1

0       100
1       200
2    python
3    300.12
4       400
dtype: object

convert data to numeric ```pd.to_numeric([data series], errors='coerce')``` ```error type: coerce, raise, ignore```

In [20]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print(df)

s1 = df.iloc[:,0]
print(s1)

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

In [30]:
list1 = ['100', '200', 'python', '300.12', '400']
ds = pd.Series(list1)
pdarr = pd.DataFrame(data=ds)
arr = np.array(ds.values.tolist())
pdarr

        0
0     100
1     200
2  python
3  300.12
4     400

In [34]:
s = pd.Series([
    ['Red', 'Green', 'White'],
    ['Red', 'Black'],
    ['Yellow']])
a = s.explode()
a.reset_index(drop=True)

0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

In [50]:
s = pd.Series(['100', '200', 'python', '300.12', '400']).sort_values()

print(s)
pd.Series(s)

0       100
1       200
3    300.12
4       400
2    python
dtype: object

0       100
1       200
3    300.12
4       400
2    python
dtype: object

In [58]:
s = pd.Series([100, 200, 300, 'python', 400])
s2 = pd.Series([700, 800])
fs = s.append(s2)
fs
ss = pd.Series(fs).sort_values()

/var/folders/x_/9bmnsvt94zvdl2tg1dlz9n640000gn/T/ipykernel_21036/2421506093.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  fs = s.append(s2)

TypeError: '<' not supported between instances of 'str' and 'int'

Qestion 3

In [60]:
import this

The Zen of Python, by Tim Peters

Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
Flat is better than nested.
Sparse is better than dense.
Readability counts.
Special cases aren't special enough to break the rules.
Although practicality beats purity.
Errors should never pass silently.
Unless explicitly silenced.
In the face of ambiguity, refuse the temptation to guess.
There should be one-- and preferably only one --obvious way to do it.
Although that way may not be obvious at first unless you're Dutch.
Now is better than never.
Although never is often better than *right* now.
If the implementation is hard to explain, it's a bad idea.
If the implementation is easy to explain, it may be a good idea.
Namespaces are one honking great idea -- let's do more of those!

In [115]:
new_dict = {
    'Name':['Tom','Jane','Steve','Lucy'],
    'Sales':[250,500,350,400],
    'Date': [2022,2020,2021,2022]}
df = pd.DataFrame(new_dict)
df

    Name  Sales  Date
0    Tom    250  2022
1   Jane    500  2020
2  Steve    350  2021
3   Lucy    400  2022

In [71]:
df.values

array([['Tom', 250, 2022],
       ['Jane', 500, 2020],
       ['Steve', 350, 2021],
       ['Lucy', 400, 2022]], dtype=object)

In [88]:
df.index = pd.DataFrame(new_dict, index=['1','rank2','rank3','rank4'])

In [84]:
df.index.name='Rank'

In [89]:
df

                     Name  Sales  Date
(Tom, 250, 2022)      Tom    250  2022
(Jane, 500, 2020)    Jane    500  2020
(Steve, 350, 2021)  Steve    350  2021
(Lucy, 400, 2022)    Lucy    400  2022

In [99]:
df.index.columns

AttributeError: 'Index' object has no attribute 'columns'

In [111]:
new_dict_v2 = {
    'Name':['Tom','Jane','Steve','Lucy'],
    'Sales':[250,500,350,400],
    'Date': [2022,2020,2021,2022],
    'Rank': ['rank1','rank2','rank3','rank4']
    } 
df2=pd.DataFrame(new_dict_v2)

In [101]:
df2

    Name  Sales  Date   Rank
0    Tom    250  2022  rank1
1   Jane    500  2020  rank2
2  Steve    350  2021  rank3
3   Lucy    400  2022  rank4

In [140]:
df2.set_index('Rank',inplace = True)

In [141]:
df2

        Name  Sales  Date
Rank
rank1    Tom    250  2022
rank2   Jane    500  2020
rank3  Steve    350  2021
rank4   Lucy    400  2022

In [112]:
df2.set_index(['Rank',"Name"], inplace = True)

In [113]:
df2.sort_index(level=["Name","Rank"],ascending=[False,True])

             Sales  Date
Rank  Name
rank1 Tom      250  2022
rank3 Steve    350  2021
rank4 Lucy     400  2022
rank2 Jane     500  2020

In [110]:
df2.reset_index()

    Rank   Name  Sales  Date
0  rank1    Tom    250  2022
1  rank2   Jane    500  2020
2  rank3  Steve    350  2021
3  rank4   Lucy    400  2022

In [116]:
df

    Name  Sales  Date
0    Tom    250  2022
1   Jane    500  2020
2  Steve    350  2021
3   Lucy    400  2022

In [117]:
type(df['Name'])

pandas.core.series.Series

In [118]:
df.Name

0      Tom
1     Jane
2    Steve
3     Lucy
Name: Name, dtype: object

In [120]:
df[['Name']]

    Name
0    Tom
1   Jane
2  Steve
3   Lucy

In [124]:
df[1:3]

    Name  Sales  Date
1   Jane    500  2020
2  Steve    350  2021

In [125]:
df[df.Name=='Tom']

  Name  Sales  Date
0  Tom    250  2022

In [126]:
df[(df['Sales']>300) & (df['Date']>2020)]

    Name  Sales  Date
2  Steve    350  2021
3   Lucy    400  2022

In [127]:
df[df["Date"].isin([2020,2022])]

   Name  Sales  Date
0   Tom    250  2022
1  Jane    500  2020
3  Lucy    400  2022

In [128]:
new_dict_v2 = {
    'Name':['Tom','Jane','Steve','Lucy'],
    'Sales':[250,500,350,400],
    'Date': [2022,2020,2021,2022],
    'Rank': ['rank1','rank2','rank3','rank4']
    } 
df2=pd.DataFrame(new_dict_v2)
df_rank = df2.set_index('Rank')

In [133]:
df_rank

        Name  Sales  Date
Rank
rank1    Tom    250  2022
rank2   Jane    500  2020
rank3  Steve    350  2021
rank4   Lucy    400  2022

In [136]:
df_rank.loc["rank1":"rank2",["Name","Sales"]]

       Name  Sales
Rank
rank1   Tom    250
rank2  Jane    500

In [137]:
df.loc[df.Sales>300,['Name','Sales']]

    Name  Sales
1   Jane    500
2  Steve    350
3   Lucy    400

In [138]:
df_rank.loc[['rank1','rank2']]

       Name  Sales  Date
Rank
rank1   Tom    250  2022
rank2  Jane    500  2020

In [139]:
df_rank.iloc[:2,2:]

       Date
Rank
rank1  2022
rank2  2020